src/artillery-rampup.yml
config:
  # insert custom config here
  phases:
    - name: 3 Users
      duration: 300
      arrivalRate: 1
      maxVusers: 5
    - name: 6 Users
      duration: 300
      arrivalRate: 1
      maxVusers: 10
    - name: 12 Users
      duration: 300
      arrivalRate: 5
      maxVusers: 25

  engines:
    playwright:
      launchOptions:
        headless: false
      contextOptions:
        httpCredentials: { "username": "user", "password": "pass" }

  # constant options
  processor: "../3-scenario/playwright-scenario.js"
  target: "http://localhost"
scenarios:
  - engine: playwright
    testFunction: "usageScenario"