src/artillery-script.yml
config:
  # insert custom config here
  phases:
    - duration: 60
      arrivalRate: 1


  engines:
    playwright:
      launchOptions:
        headless: true


  # constant options
  processor: "./playwright-scenario.js"
  target: "http://localhost"
scenarios:
  - engine: playwright
    testFunction: "usageScenario"