src/artillery-script.yml
config:
  # insert custom config here
  phases:
    - duration: 60
      arrivalRate: 1
      maxVusers: 1

  engines:
    playwright:
      launchOptions:
        headless: false

  # constant options
  processor: "../3-scenario/playwright-scenario.js"
  target: "http://localhost"
scenarios:
  - engine: playwright
    testFunction: "usageScenario"