src/artillery-script.yml
config:
  # insert custom config here
  phases:
    - duration: 60
      name: Single Users
      arrivalRate: 1
      maxVusers: 1

  engines:
    playwright:
      launchOptions:
        headless: false
      contextOptions:
        httpCredentials: { "username": "user", "password": "pass" }

  # constant options
  processor: "../3-scenario/playwright-scenario.js"
  target: "http://localhost"
scenarios:
  - engine: playwright
    testFunction: "usageScenario"